export interface LeadClientContentProps {
  name?: string;
}

export function leadClientContent({ name }: LeadClientContentProps) {
  return `
  <p style="font-size: 15px; line-height: 1.6;">
    Привіт, ${name}!
    Ми отримали вашу заявку та вже працюємо над нею.
  </p>

  <p style="font-size: 15px; line-height: 1.6;">
    Найближчим часом я звʼяжусь з вами, щоб уточнити деталі.
  </p>

  <p style="font-size: 15px; line-height: 1.6;">
    Інформація та документи з даного листа можуть містити адвокатську таємницю,
    що охороняється законом, та призначені для використання виключно особою,
    якій вони адресовані.
    Якщо ви не зазначений адресат, прошу невідкладно повідомити про це
    відправника та негайно видалити всі отримані документи без їх збереження,
    копіювання або розголошення.
  </p>
  `;
}
